#include <iostream>
using namespace std;

/*
     &     有0必0
	 &&    有假必假
*/

int main() {
	// 1. 位与运算符的定义
	int a = 0b1010;   // 10
	int b = 0b0110;   // 6
	//      0b0010;   // 2
	cout << (a & b) << endl;
	cout << "--" << endl;

	// 2. 奇偶性
	cout << 5 % 2 << endl;      // % 优先级高、效率高
	cout << (5 & 1) << endl;    // & 优先级低、效率高
	//   0b101
	//   0b001
	cout << "--" << endl;

	// 3. 获取一个数二进制的末5位
	int c = 0b1010010101001;  // 后五位 01001
	cout << (c & 0b11111) << endl;
	cout << "--" << endl;

	// 4. 将末五位归零
	int d = 0b11111111111111111111111111100000;
	cout << (c & d) << endl; // 0b1010010100000
	cout << "--" << endl;
 
	// 5. 消除末尾连续的1
	int e = 0b101010111111;
	// e+1= 0b101011000000;
	//  & = 0b101010000000;
	cout << (e & (e + 1)) << endl;

	// 6. 2的幂判定
	int f = 0b100000000;
	// f-1= 0b011111111;
	//   &= 0b000000000 = 0;
	(f > 0) && ((f & (f - 1)) == 0);


	return 0;
}