/*



________________________________________________________________________________________
0X00000004|0X00000008|...|...|...|...|...|...|                                              内存地址
    10         20                                                                           变量值
    a           b                                                                           变量名
----------------------------------------------------------------------------------------

____________________________________________
0x00000010|0x00000011|0x00000012|0x00000013       内存地址
0X00000004                                        变量值
    pa                                            变量名
--------------------------------------------------

*/


#include <iostream>

using namespace std;

int main() {
    int a = 10;
    int b = 20;
    // 1. 指针变量的定义
    // 数据类型 * 指针变量名;
    int *pa;
    pa = &a;
    // pa = &b;

    printf("%#X %#X\n", &a, pa);

    // 2. 解引用
    // *指针变量名 = 数值;
    *pa = 7;
    cout << a << ' ' << (*pa) << endl;
    cout << "-------" << endl;
    // 3. * 和 &
    // *&a = *(&a) = *pa = a;
    // &*pa = &(*pa) = &a = pa;
    cout << (*&a) << endl;
    cout << (*(&a)) << endl;
    cout << (*pa) << endl;
    cout << (a) << endl;
    cout << "-------" << endl;
    cout << (&*pa) << endl;
    cout << (&(*pa)) << endl;
    cout << (&a) << endl;
    cout << (pa) << endl;

    return 0;
}














